{
  "blogs": [
    {
      "id": 1,
      "title": "“Wagha-Bonding”: Shedding inhibitions along the Indo-Pakistan borders",
      "body": "In one of my pensive modes that came with my profession as a writer, looking at the bright screen, sitting in the dark cave that was my haven the other times, I realised I needed to pause.The best of escapes are the ones from where you returned with a purpose, a perspective or a rejuvenated idea of living. I wanted all of that. I am the daughter of an officer with the Indian Police Force. My brother is an officer with the Indian Army. With deep ties to people committed to serving the country, I’ve always been curious to experience the kind of patriotism, first hand. That’s what led me to this meaningful solo trip to the Indo-Pakistan border in Punjab.Located at a distance of around 28 km from Amritsar, the Wagah Border is known as the only ceremonial border between India and Pakistan.Within a couple of hours, I was already on the flight to Amritsar. Whenever I travel, I like to equate whether or not I score a window seat as a sign of how lucky this trip is going to be. I got one on this trip – I knew then tht the Wagah border trip was not going to disappoint me. Looking out of the plane while listening to my favourite country music, contemplating life is seemingly effortless.A journey, after all, is not just an escape; it’s a series of introspection by the windows of planes, buses, cabs, and trains, in brief, discontinuous episodes. The view of the beautiful city Amritsar looked heavenly as we kept zooming in. Its gleaming golden temple was visible from the sky above.I knew I had to board a bus or hail a cab to reach the Wagah border. It was 12 PM, and I had to arrive there before 3 PM if I wished to secure a seat in the stadium to witness the Beating Retreat border ceremony. I booked a cab to reach faster and to avoid too much hassle.",
      "author": "Ginni Gold"
    },
    {
      "id": 2,
      "title": "Is it Ethical to Travel Now? With that Freedom Comes Responsibility",
      "body": "Is it ethical to travel now? The relationship between freedom and responsibility might provide you the answer.Popular question these days. The temptation to answer “yes” or “no” misses the opportunity to separate the issues facing travelers, including that our freedom to travel carries with it a personal responsibility — just as it always has.There’s nothing new there. It’s just that the din of the pre-COVID travel party and the freedom cocktail we all shared drowned out most of the conversation about personal responsibility in travel.Then COVID-19 came along and pressed a gigantic pause button, including on our assumptions. It subjected us to some travel deprivation and served up some forced reflection. It also seems to have tricked us into thinking that some of the ethical considerations surrounding our travel decisions are new when they’re not.As our own health and well-being have come into sharper focus, so has the health and well-being of others — something that probably should have been atop everyone’s radar all along.Freedom, Responsibility and Meaning: The Travel PayoffFreedom, however is not the last word. Freedom is only part of the story and half of the truth. Freedom is but the negative aspect of the whole phenomenon whose positive aspect is responsibleness. In fact, freedom is in danger of degenerating into mere arbitrariness unless it is lived in terms of responsibleness.When we go out into the world – whether across the globe or around the block – we exercise a freedom. That freedom is paired with a responsibility to ourselves and to others. We can choose to ignore that responsibility. If we do, we slowly — and usually imperceptibly — erode those freedoms.For example, at home we have a responsibility to pick up after ourselves. If we throw trash on our streets and everyone follows suit, we live in garbage together. If we walk down the sidewalk as if the sidewalk is ours alone, and others do the same, we collide.",
      "author": " Daniel Noll"
    },
    {
      "id": 3,
      "title": "Oaxaca Food: A Culinary Travel Guide",
      "body": "What is Oaxaca food? Which Oaxacan dishes should you seek out and what sort of flavors and spices might you find when you visit this city and region in southwestern Mexico? We spent two months living in Oaxaca to find out and explore Oaxacan cuisine. This Oaxaca Food and Culinary Travel Guide guide shares our favorite Oaxacan street food traditional dishes, snacks, drinks, and desserts, plus where to find them in this beautiful culinary city.If Mexican cuisine ranks as one of the world’s great cuisines (it was the first cuisine to receive UNESCO culinary heritage status), it’s certainly aided in part by what goes on in the kitchens of Oaxaca.Oaxacan food: roasted, subtle, rich, layered.Moles, chocolate, tiny avocados that taste faintly like licorice, giant balls of quesillo cheese ribbons, grasshoppers, whopping Mexican pizzas, stunning grilled meats, corn fungus, mysterious herbs like epazote, and more types of chili peppers thanyou can shake a fire extinguisher at.Oaxaca. Say it with me: Wa-ha-ka. We won’t lie: when we opted to spend a couple of months in Oaxaca, Mexico its cuisine was certainly a major factor in our decision.We used the gourmandish pretext of “We need to discover what Oaxacan food is all about” as an excuse to explore the city and to eat ourselves silly. We took a Oaxacan cooking class to give ourselves background. We cornered our Mexican landlord each time we saw him to ask about his favorite Oaxacan street food stands and dishes.Some might say we were obsessed.I say we were focused.As friends and readers have made their way to Oaxaca, we’ve sent Oaxacan food information and recommendations in bits and bobs by email. Now it’s time to put it all together to share with you our massive Oaxaca Food Guide with 41 recommended dishes, street food, moles, desserts, drinks and more.Note: Oaxaca, as we use it, will generally refer to the city of Oaxaca, the capital of the Mexican state of Oaxaca, which kindly stretches down to a beautiful coastline in southern Mexico. Oaxacan restaurant and Oaxacan cooking class recommendations are listed within.",
      "author": "Daniel"
    },
    {
      "id": 4,
      "title": "Lessons in Planning and Traveling During COVID-19",
      "body": "How did you research and plan a trip during COVID-19? Did you take any additional travel safety measures or change your behaviors? What's it like to travel now? In this article we address focusing on the stuff in our control while minding the health and safety of others. The lessons apply not only to travel but also to daily life, during COVID-19 and beyond. We touch on decision-making, logistics, managing risk, flexibility, adapting to new information, managing expectations and satisfaction.If you’ve followed our social media activity lately you’ll know that we recently returned from a trip to Italy to celebrate our 20th wedding anniversary. It was our first trip outside of our adopted home Berlin and its surroundings in nearly seven months.Sure, we had plenty of reservations. We questioned whether we ought to travel at all. Given the pandemic, we were not only concerned about our own enjoyment and safety, but also more attuned to the safety of others and the impact of our visit. Our decision-making process while planning and taking this trip was more deliberate and careful than usual. We considered all potential impacts — good and bad — as we researched, planned and executed the trip.As we responded to questions from friends, family and readers, it occurred to us that it might be useful to turn our travel planning and on-the-road process during COVID-19 inside-out here.",
      "author": "Gabriel"
    },
    {
      "id": 5,
      "title": "Travelling Solo and Loving it – My Himalayan Love Story!",
      "body": "“You are a curious and a restless soul, and that is the problem and the solution to everything!”Growing up being a defense officer’s daughter certainly has its takeaways. I was five when I sailed in a defense ship for the first time, eight when I learned how to swim and thirteen when I scuba dived for the first time in my life, this was in the Andaman. My father served in the Indian Coast Guard for 28 years and hence I spent the first 18 years of my life very close to the sea. Not to mention the need for adrenaline rush began at a nascent stage in my life. Before Goa became Goa, I spent 3 years of my final schooling in Vasco. I had seen so much of Goa in that time that going back there for another mundane vacation was not on my list. Clearly I had seen so much of sea that a beach vacation did not excite me anymore.I began most of my travel sojourns only after I completed bachelors from Delhi University. I started a desk banking job, made new friends and luckily those that loved to travel, and there it was, the beginning. Lying to parents just to travel had begun! I started exploring the mountains, when I was 22, with the first trip to Dharamshala. I had been to the mountains as a kid, to Shimla and Manali, but with folks (does anyone count those trips?). I traveled nonstop for the next two years and every time to the mountains, the more I’d travel there, the more I’d want!My first ever Enfield trip was in 2009 through the Grand Hindustan Tibet Road – Spiti Valley. Back then no one knew what or where this valley was. It was the most gruesome experience of my life until then; I was 22 and had no idea of what I was getting into. It was an adventure I took when I was nowhere close to ready and had several falls and injuries during the ride, but I survived and that was all that mattered. I realized that I was stronger than I thought, though I was still too young to understand what that meant.I had tasted blood and so in 2010 I decided to take the Manali – Leh – Srinagar road trip with friends. This time I was better prepared. I consider myself lucky to have explored these places while they were still untouched. The beauty of the mountains started to infuse in my blood streams in a way that I never imagined it would. I didn’t care anymore about the company I was in, I started falling in love with the mountains and that’s all I could see and feel around me, the mighty Himalayas!I moved to Switzerland for my post-graduation and by then the fear of solo travel had gone far away. Even though Switzerland is beautiful, nothing beats the beauty of the mighty Himalayas. I traveled to Netherlands, Belgium, Italy, France and Germany. It was an unforgettable experience no doubt. I started loving the feeling of being a lone gypsy, just heading out to a destination, staying in cheap accommodations and reading maps to find places. Being in Europe for two years I got the chance to fulfill some of my childhood dreams, one was going to Disneyland in Paris and the other was to visit Anne Frank’s Memorial in Amsterdam. It was now that I, secretly in my mind, had started thinking of opening my own travel venture, and started building it up in ",
      "author": "Tania Roy"
    },
    {
      "id": 6,
      "title": "Virtual Bike Ride. Valenciennes to Caudry.",
      "body": "A grey, but dry, morning that improved towards lunch time. To be fair we knew the forecast was much better for the afternoon but by cycling in the morning we know we have the rest of the day free. Today's ride was up to Bashall Eaves, Cow Ark, Middle Lees, Whitewell and St Hubert's Church at Dunsop Bridge. Turn round and almost back on the same route. St Hubert's church was my childhood church and I was baptized, made my first communion and was confirmed there.On our virtual ride it's another day of gentle rolling hills, through farm lands. Now we are beginning to see huge War Grave Cemeteries such as 'Solesmes British Cemetery'. Very strangely the first grave that we saw when we stopped was the grave of a cyclist.The First World War began as a very mobile war which proved perfect for bicycles. Both sides used a large number of bikes to help their troops get to the front lines as quickly as possible, and there were numerous reports of their cycling bravery in the British press. However, as thewar descended into the hellish pits of trench warfare, bicycles proved more and more ineffective on the Front Line. But, this does Caudry is a City mainly known as the Capitol of French Lace Making. The City is a lead supplier for many famous fashion houses and Caudry lace was used for the wedding dress of Catherine Duchess of Cambridge's wedding gown.",
      "author": "Tommy"
    },
    {
      "title": "jhaji",
      "body": "hauu",
      "author": "author1",
      "id": 8
    }
  ]
}